// var a = { "Ё": "YO", "Й": "I", "Ц": "TS", "У": "U", "К": "K", "Е": "E", 
// "Н": "N", "Г": "G", "Ш": "SH", "Щ": "SCH", "З": "Z", "Х": "H", "Ъ": "'", 
// "ё": "yo", "й": "i", "ц": "ts", "у": "u", "к": "k", "е": "e", "н": "n", 
// "г": "g", "ш": "sh", "щ": "sch", "з": "z", "х": "h", "ъ": "'", "Ф": "F", 
// "Ы": "I", "В": "V", "А": "a", "П": "P", "Р": "R", "О": "O", "Л": "L", 
// "Д": "D", "Ж": "ZH", "Э": "E", "ф": "f", "ы": "i", "в": "v", "а": "a", 
// "п": "p", "р": "r", "о": "o", "л": "l", "д": "d", "ж": "zh", "э": "e", 
// "Я": "Ya", "Ч": "CH", "С": "S", "М": "M", "И": "I", "Т": "T", "Ь": "'", 
// "Б": "B", "Ю": "YU", "я": "ya", "ч": "ch", "с": "s", "м": "m", "и": "i", 
// "т": "t", "ь": "'", "б": "b", "ю": "yu" };

var a = {
  "Ё": "yo", "Й": "i", "Ц": "ts", "У": "u", "К": "k", "Е": "e",
  "Н": "n", "Г": "g", "Ш": "sh", "Щ": "sch", "З": "z", "Х": "h", "Ъ": "",
  "ё": "yo", "й": "i", "ц": "ts", "у": "u", "к": "k", "е": "e", "н": "n",
  "г": "g", "ш": "sh", "щ": "sch", "з": "z", "х": "h", "ъ": "", "Ф": "f",
  "Ы": "i", "В": "v", "А": "a", "П": "p", "Р": "r", "О": "o", "Л": "l",
  "Д": "d", "Ж": "zh", "Э": "e", "ф": "f", "ы": "i", "в": "v", "а": "a",
  "п": "p", "р": "r", "о": "o", "л": "l", "д": "d", "ж": "zh", "э": "e",
  "Я": "ya", "Ч": "ch", "С": "s", "М": "m", "И": "i", "Т": "t", "Ь": "",
  "Б": "b", "Ю": "yu", "я": "ya", "ч": "ch", "с": "s", "м": "m", "и": "i",
  "т": "t", "ь": "", "б": "b", "ю": "yu", " ": "_"
};

module.exports = function transliterate(value) {
  return value.split('').map(function (char) {
    return a[char] || char;
  }).join("").toLowerCase();;
}
